FemDesign.Releases.RigidityDataType3
rigidity_data_type3

FemDesign.Releases.RigidityDataType3._friction
Type string in order to make field nullable. When null FEM-Design will load default value.

FemDesign.Releases.RigidityDataType3.#ctor
Parameterless constructor for serialization.

FemDesign.Releases.RigidityDataType3.#ctor(FemDesign.Releases.Motions,FemDesign.Releases.Rotations)
Construct RigidityDataType3 with default friction

FemDesign.Releases.RigidityDataType3.#ctor(FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits,FemDesign.Releases.Rotations,FemDesign.Releases.RotationsPlasticLimits)
Construct RigidityDataType3 with default friction

FemDesign.Releases.RigidityDataType3.#ctor(FemDesign.Releases.Motions,FemDesign.Releases.Rotations,System.Double)
Construct RigidityDataType3 with defined friction

FemDesign.Releases.RigidityDataType3.HingedLine
Construct simple hinged line RidigityDataType3.

FemDesign.Releases.RigidityDataType3.RigidLine
Construct simple rigid line RigidityDataType3.